## Selection & Indexing

In [2]:
import pandas as pd
import numpy as np

# Base DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 22],
    'City': ['New York', 'London', 'Paris', 'New York', 'Tokyo'],
    'Salary': [50000, 60000, 55000, 70000, 65000]
}
df = pd.DataFrame(data, index=['row1', 'row2', 'row3', 'row4', 'row5'])
print(df)

         Name  Age      City  Salary
row1    Alice   25  New York   50000
row2      Bob   30    London   60000
row3  Charlie   35     Paris   55000
row4    David   40  New York   70000
row5      Eva   22     Tokyo   65000

In [3]:
# 21. Select a single column: DataFrame se 'Name' column ko ek Series ke roop mein select karein.
df['Name']

row1      Alice
row2        Bob
row3    Charlie
row4      David
row5        Eva
Name: Name, dtype: object

In [4]:
# 22. Select multiple columns: DataFrame se 'Name' aur 'Age' columns ko ek naye DataFrame ke roop mein select karein. 
df[['Name','Age']]

         Name  Age
row1    Alice   25
row2      Bob   30
row3  Charlie   35
row4    David   40
row5      Eva   22

In [5]:
# 23. Select a row using loc: Label-based indexing ka use karke index 'row1' waali row ko select karein.
df.loc['row1']

Name         Alice
Age             25
City      New York
Salary       50000
Name: row1, dtype: object

In [7]:
# 24. Select rows using iloc: Integer-based indexing ka use karke doosri row (index 1) ko select karein.
df.iloc[1]

Name         Bob
Age           30
City      London
Salary     60000
Name: row2, dtype: object

In [9]:
# 25. Select a range of rows: iloc ka use karke index 2 se index 5 tak ki rows ko select karein.
df.iloc[2:6]

         Name  Age      City  Salary
row3  Charlie   35     Paris   55000
row4    David   40  New York   70000
row5      Eva   22     Tokyo   65000

In [10]:
# 26. Select a single value: loc ka use karke ek specific row aur column ka value select karein (e.g., row 'row2', column 'col1').
df.loc['row2','Name']

'Bob'

In [12]:
# 27. Select a slice of data: loc ka use karke specific rows aur columns ka ek subset select karein.
subset = df.loc['row2':'row4', ['Name', 'Salary']]
subset

         Name  Salary
row2      Bob   60000
row3  Charlie   55000
row4    David   70000

In [36]:
# 28. Select a single column's first 5 rows: 'Age' column ke pehle 5 values ko select karein. 
df['Age'].head(5)

row1    25
row2    30
row3    35
row4    40
row5    22
Name: Age, dtype: int64

In [37]:
# 29. Set a column as the index: 'Name' column ko DataFrame ka naya index banayein. 
df.set_index('Name', inplace=False)

         Age      City  Salary
Name
Alice     25  New York   50000
Bob       30    London   60000
Charlie   35     Paris   55000
David     40  New York   70000
Eva       22     Tokyo   65000

In [38]:
# 30. Reset the index: DataFrame ke index ko reset karke default integer index par wapas layein.
df.reset_index(drop=False)

  index     Name  Age      City  Salary
0  row1    Alice   25  New York   50000
1  row2      Bob   30    London   60000
2  row3  Charlie   35     Paris   55000
3  row4    David   40  New York   70000
4  row5      Eva   22     Tokyo   65000